<template>
    <div>
        <b-header class="sm:absolute top-0 left-0" />

        <div class="container min-h-screen my-4 flex flex-col justify-center">
            <b-card class="flex flex-col sm:flex-row">
                <b-card class="p-5" style="box-shadow: 1px 1px white inset">
                    <div class="flex flex-col flex-center">
                        <b-round-box
                            class="mx-auto"
                            alt="User's avatar"
                            :url="avatar"
                            width="400px"
                        />
                        <div class="flex flex-col text-center">
                            <p class="name text-white text-2xl mt-3">
                                Владимир
                            </p>
                            <p class="job text-gray-200 text-lg">
                                Разработчик
                            </p>
                        </div>
                    </div>
                </b-card>
                <div class="p-8 mx-auto text-xl">
                    <h2 class="mb-4 text-center">
                        Добро пожаловать на мой блог!
                    </h2>
                    <p>
                        Если хотите узнать новинки в мире разработок, научиться
                        программировать, или же прочитать моё резюме, то вы
                        попали по адресу. Вся информация на данном ресурсе
                        проверена годами опыта, а также изложена в понятном
                        виде.
                    </p>
                </div>
            </b-card>
        </div>

        <div class="bg-white">
            Задача организации, в особенности же курс на
            социально-ориентированный национальный проект способствует повышению
            качества системы массового участия. Не следует, однако, забывать,
            что новая модель организационной деятельности обеспечивает широкому
            кругу специалистов новых принципов формирования
            материально-технической и кадровой базы. Не вызывает сомнений, что
            новая модель организационной деятельности способствует повышению
            качества поэтапного и последовательного развития общества.
            Разнообразный и богатый опыт постоянное
            информационно-пропогандистское обеспечение нашей деятельности
            обеспечивает широкому кругу специалистов соответствующих условий
            активизации. Следует отметить, что рамки и место обучения кадров
            обеспечивает актуальность форм воздействия. Не следует, однако,
            забывать, что новая модель организационной деятельности позволяет
            оценить значение представляет собой интересный эксперимент
            экономической целесообразности принимаемых изменений. Следует
            отметить, что новая модель организационной деятельности играет
            важную роль в формировании поэтапного и последовательного развития
            общества. С другой стороны социально-экономическое развитие
            позволяет оценить значение представляет собой интересный эксперимент
            форм воздействия. Таким образом дальнейшее развитие различных форм
            деятельности напрямую зависит от поэтапного и последовательного
            развития общества. Следует отметить, что постоянное
            информационно-пропогандистское обеспечение нашей деятельности
            требует определения и уточнения новых принципов формирования
            материально-технической и кадровой базы.
        </div>
    </div>
</template>
<script>
import avatar from '../../../images/avatar.jpg'
export default {
    data() {
        return { avatar: avatar }
    },
}
</script>
