<template>
    <div>
        <div :v-for="q in getQuestions" :key="q">
            {{ q.id }}
            <h4>{{ q.text }}</h4>
            <p>{{ q.answer }}</p>
        </div>

        <b-card class="px-7 py-4">
            С другой стороны повышение уровня гражданского сознания играет
            важную роль в формировании экономической целесообразности
            принимаемых изменений. Прежде всего постоянное
            информационно-пропогандистское обеспечение нашей деятельности
            способствует подготовке и реализации новых предложений. Задача
            организации, в особенности же высокотехнологичная концепция
            общественной системы обеспечивает широкому кругу специалистов модели
            развития.
        </b-card>
        <b-card class="px-7 py-4">
            С другой стороны повышение уровня гражданского сознания играет
            важную роль в формировании экономической целесообразности
            принимаемых изменений. Прежде всего постоянное
            информационно-пропогандистское обеспечение нашей деятельности
            способствует подготовке и реализации новых предложений. Задача
            организации, в особенности же высокотехнологичная концепция
            общественной системы обеспечивает широкому кругу специалистов модели
            развития.
        </b-card>
    </div>
</template>

<script>
export default {
    mounted() {
        this.$blog.dispatch('ajaxQuestionsFromDB')
    },
    computed: {
        getQuestions() {
            return this.$blog.getQuestions
        },
    },
}
</script>
