<?php
return [
    'test' => 'Тест',
    'warning' => 'Предупреждение',
    'this_site_uses' => 'Этот сайт использует',
    'cookies' => 'Печенье',
    'dont_like_cookies' => 'Если не любите печенье, то можете его выключить в настройках браузера.',
    'welcome_to_blog' => 'Добро пожаловать на мой блог',
    'okay_fine' => 'Хорошо',
    'vladimir' => 'Владимир',
    'developer' => 'Разработчик',
    'home_description' => 'Если хотите узнать новинки в мире разработок, научиться
                        программировать, или же прочитать моё резюме, то вы
                        попали по адресу. Вся информация на данном ресурсе
                        проверена годами опыта, а также изложена в понятном
                        виде',
    'read_resume' => 'Почитать резюме',
    'view_contacts' => 'Посмотреть контакты',
    'what_i_do' => 'Что я умею',
];
