<?php
return [
    'test' => 'Тест',
    'blog_name' => 'Dev Сайт Владимира',
    'warning' => 'Предупреждение',
    'this_site_uses' => 'Этот сайт использует',
    'cookies' => 'Печенье',
    'dont_like_cookies' => 'Если не любите печенье, то можете его выключить в настройках браузера.',
    'welcome_to_blog' => 'Добро пожаловать на мой блог',
    'okay_fine' => 'Хорошо',
    'vladimir' => 'Владимир',
    'developer' => 'Разработчик',
    'home_description' => 'Если хотите прочитать обо мне, то вы
                        попали по адресу. Вся информация на данном ресурсе изложена в понятном
                        виде',
    'read_resume' => 'Почитать резюме',
    'view_contacts' => 'Посмотреть контакты',
    'what_i_do' => 'Что я умею',
    'what_i_know' => 'Что я знаю',
    'about_me' => 'Обо мне',
    'my_projects' => 'Мои работы',
    'documents' => 'Документы',
    'other_documents' => 'Другие документы',
    'my_certificates' => 'Мои сертификаты',
    'contact_with_me' => 'Связаться со мной',
    'links' => 'Ссылки',
    'my_stack' => 'Мой стек',
    'frameworks' => 'Фреймворки',
];
