<?php

return [
    'various_languages' => 'Работать с различными менеджерами пакетов и сборщиками на различных языках',
    'and_others' => 'и прочие',
    'and_also_own_libs' => 'а также писать свои библиотеки',
    'auto_deploy_with' => 'Настраивать автодеплой с помощью',
    'hooks_or_using' => 'хуков, или через',
    'as_manually_through' => 'а также в ручную через',
    'resolve_branch_conflicts' => 'Умею решать конфликты веток, делать merge',
    'work_with_integrations' => 'Строить сборки и запускать автоматизированные тесты, работать с интеграциями (CI), например,
                            Travis, <i class="fab fa-github"></i> Github Actions, или CircleCI.',
    'deploying_own_project' => 'Разворачивать собственные проекты с нуля до стадии релиза, настраивать взаимодействие между
                            приложениями, сайтами через HTTP/REST API.',
    'deploying_with_docker' => 'Разворачивать проекты, создавать образы с помощью <i class="fab fa-docker"></i> Docker.',
    'my_own_projects' => 'Писать проекты для онлайн-игр, имел собственный проект серверов NeoLife.',
    'servers_on_linux' => 'Настраивать сервера на базе <i class="fab fa-linux"></i> Linux /
                            <i class="fab fa-fedora"></i> Fedora (в основном <i class="fab fa-centos"></i> Centos 8),
                            автоматизировать рутинные задачи с помощью Cron.',
    'jinja_blade' => 'Пользоваться шаблонами (Jinja, Blade) веб-страниц, тегами шаблонов, пользоваться компонентным подходом при вставке элементов сайта.',
    'auto_docs' => 'Автоматически создавать документацию с помощью внешних генераторов документации.',
    'read_external_code' => 'Читать чужой код, и пользоваться инструментами для отладки, писать полные и понятные комментарии к коду.',
    'teach_other_people' => 'Понятно и довольно быстро обучать других людей, заинтересованных в обучении.',
    'second_block' => '<li>ООП, классы, объекты (instances), методы классов, интерфейсы (описатели классов),
                            конструкторы,
                            указатели и прочие базовые вещи.
                        </li>
                        <li>Все основные команды <i class="fab fa-git-alt"></i> Git (которые мне кажутся основными)</li>
                        <li>Принципы SOLID, Dry, Kis, и другие</li>
                        <li>Синтаксис баз данных, построение запросов, транзакций</li>
                        <li>Запросы в GraphQL и FaunaDB</li>
                        <li>HTTP/REST API запросы и ответы, к примеру библиотеку Ajax, или Axios</li>
                        <li>Асинхронный код, многопоточность, Promises, и прочее</li>
                        <li>Языки <i class="fab fa-python"></i> Python, GO, веб-языки,
                            включая
                            <i class="fab fa-php"></i> PHP,
                            <i class="fab fa-js"></i> JS и стандарт EcmaScript,
                            <i class="fab fa-golang"></i> GoLang (энтузиаст), Lua, 1С
                        </li>
                        <li>Регулярные выражения (RegExp), выборки из строк</li>
                        <li>Хеш-таблицы и хеш-функции для малозатратного поиска</li>',
];
