<?php

return [
    'type' => 'Тип',
    'teamwork' => 'командная',
    'solo_work' => 'одиночная',
    'rosretail' => 'Московский сайт для продажи ритейл-бизнеса.
            Слайдер в начале страницы и его бек-енд создавался мной.
            Фильтры создавали всей командой. Также полностью сделал динамический поиск в фильтре. В основном работал над фильтрами и подборками недвижимости.',
    'arendator' => 'Московский сайт для аренды квартир. Здесь все фильтры динамические.',
    'telegram-bots' => 'Боты для мессенджера телеграм. Создал два вида ботов: <a href="https://t.me/WhitewillBot" target="_blank">по интерактивной продаже недвижимости</a>, а также <a href="https://t.me/whitewilladbot" target="_blank">рекламный бот</a>',
    'sofilena' => 'Магазин женской одежды. Одна из моих первых работ, написанная в связке с Битрикс. Сайт полностью подключён к 1С, и активно дорабатывался.',
    'bonussofilena' => "Отдельная система для работы с бонусными картами в магазинах SofiLena. Ведётся активная база данных по операциям с клиентами. Весь сайт полностью написан мной, подключён с помощью API к 1С торговле.",
];
